### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
!       handler                        = "src.main.handler" -> "main.handler"
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-16T21:09:03.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:29",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:25" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:25/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda"
!       s3_key                         = "lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip" -> "lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip"
!       s3_object_version              = "KVHhRHrQ7JHD1yzRdKntHHP2MwEBASDg" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       timeout                        = 6 -> 3
!       version                        = "25" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "25" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "25e498c38fb4d513f90c88aec8540ddd" -> (known after apply)
!       id                     = "lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip" -> (known after apply)
!       key                    = "lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip" -> "lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip" -> "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "KVHhRHrQ7JHD1yzRdKntHHP2MwEBASDg" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!src/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./src",
+                       "vendor",
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4552302386451537039" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip" -> "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip"
!           "timestamp" = "1692219324388839000" -> "1692221477844952200"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "4692239220239629024" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/7be05bf1a1328d71717abdd1df91a7ae2afe25898ae01b6a8ce4f7bd044d6454.zip" -> "./.terraform/lambda-builds/bd75ae555b59ddfde5cdf9e77d6c2cc7fbcb7311b59aa3327c64ea72281dbeee.zip"
!           "original_source_code" = "\"./src\"" -> jsonencode(
                [
+                   {
+                       path          = "./src"
+                       patterns      = <<-EOT
                            !src/.*
                        EOT
+                       prefix_in_zip = "vendor"
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:29" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-16T20:56:26.437+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:29" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/0d535041746e0b1186065179f0741845e1ad32edfae793380b062bdd56383ff5.zip" -> "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.zip"
!       s3_object_version           = "JDPl.mBf7Yg9uMooUxJcu4KF8O0u7M5k" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "TAzTT6KSfM3wi2OzdRyOwkFOzggcJNcj0C0Q2iRre8Y=" -> (known after apply)
!       source_code_size            = 29718801 -> (known after apply)
!       version                     = "29" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "7bd3df6e3ca21ae8447d2a215cd88390-6" -> (known after apply)
!       id                     = "builds/0d535041746e0b1186065179f0741845e1ad32edfae793380b062bdd56383ff5.zip" -> (known after apply)
!       key                    = "builds/0d535041746e0b1186065179f0741845e1ad32edfae793380b062bdd56383ff5.zip" -> "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/0d535041746e0b1186065179f0741845e1ad32edfae793380b062bdd56383ff5.zip" -> "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "JDPl.mBf7Yg9uMooUxJcu4KF8O0u7M5k" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "1409111093047855044" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/0d535041746e0b1186065179f0741845e1ad32edfae793380b062bdd56383ff5.zip" -> "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.zip"
!           "timestamp" = "1692219326197815000" -> "1692221479745579000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "1932683731057791470" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/0d535041746e0b1186065179f0741845e1ad32edfae793380b062bdd56383ff5.zip" -> "builds/a7359c61478a155a4576e61a67e5c531bba484aa789ce19f4097c2db890fc989.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>